# Это программа на python показывает расписание на ближайший учебный день

bells = ["Урок безопасности: 8.25 - 8.40", "1 урок: 8.45 - 9.25", "2 урок: 9.35 - 10.15", "3 урок: 10.25 - 11.05",
         "4 урок: 11.15 - 11.55", "5 урок: 12.10 - 12.50", "6 урок: 13.05 - 13.45", "7 урок: 13.55 - 14.35",
         "8 урок: 14.45 - 15.25"]

def monday_ras():
    print("Учебный день недели - понедельник")
    print(" ")
    print("расписание уроков на понедельник")
    print(" ")
    print("В понедельник 8 уроков")
    print(" ")
    monday = ["1 - Разговор о неважном", "2 - Английский язык", "3 - Химия", "4 - История", "5 - Математика",
              "6 - Русский язык", "7 - Статистика и вероятность", "8 - Физическая культура"]
    for i in monday:
        print(i)
    print(" ")
    print("Расписание звонков в понедельник")
    print(" ")
    for i in bells:
        print(i)

def tuesday_ras():
    print("Учебный день недели вторник")
    print(" ")
    print("Во вторник 7 уроков")
    print(" ")
    print("Расписание уроков на вторник")
    print(" ")
    tuesday = ["1 - Информатика", "2 - Математика", "3 - Обществознание", "4 - Физика", "5 - Литература",
               "6 - Иностранный язык", "7 - Физическая культура"]
    for i in tuesday:
        print(i)
    print(" ")
    print("Расписание звонков во вторник")
    print(" ")
    for i in bells:
        print(i)

def wednesday_ras():
    print("Учебный день недели - среда")
    print(" ")
    print("В среду 7 уроков")
    print(" ")
    print("Расписание уроков на среду")
    print(" ")
    wednesday = ["1 - Русский язык", "2 - Обществознание", "3 - Информатика", "4 - Математика", "5 - Литература",
                 "6 - Алгоритмика", "7 - Математика"]
    print("В среду 7 уроков")
    for i in wednesday:
        print(i)
    print(" ")
    print("Расписание звонков на среду")
    print(" ")
    for i in bells:
        print(i)

def thursday_ras():
    print("Учебный день недели - четверг")
    print(" ")
    print("В четверг 7 уроков")
    print(" ")
    print("Расписание уроков на четверг")
    print(" ")
    thursday = ["1 - Россия - мои горизонты", "2 - География", "3 - Математика", "4 - Английский язык", "5 - История",
                "6 - Информатика", "7 - Физическая культура"]
    for i in thursday:
        print(i)
    print(" ")
    print("Расписание звонков на четверг")
    print(" ")
    for i in bells:
        print(i)

def friday_ras():
    print("Учебный день недели - пятница")
    print(" ")
    print("В пятницу 7 уроков")
    print(" ")
    print("Расписание уроков на пятницу")
    print(" ")
    friday = ["1 - Математика", "2 - Литература", "3 - Информатика", "4 - ОБЗР", "5 - Биология", "6 - Математика",
              "7 - Физика"]
    for i in friday:
        print(i)
    print(" ")
    print("Расписание звонков на пятницу")
    print(" ")
    for i in bells:
        print(i)


def schedule():

    print("Введите день недели, расписание на который хотите узнать (в нижнем регистре)")
    day = input()

    while 1:
        if day == "понедельник":
            monday_ras()
            break
        elif day == "вторник":
            tuesday_ras()
            break
        elif day == "среду":
            wednesday_ras()
            break
        elif day == "четверг":
            thursday_ras()
            break
        elif day == "пятница":
            friday_ras()
            break
        else:
            print("Сообщение не распознано, введите заново")
            day = input()

schedule()
